In [1]:
# from link:https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html
import numpy as np
import pandas as pd

# Series是一个一维带标签的数组，可以持有任意类型的数据。轴标签统称为索引。
# 通过使用一个值的集合来创建一个Series，pandas会创建默认的整数索引
s = pd.Series([3,2,1,np.nan, 2,0])
print(s)

0    3.0
1    2.0
2    1.0
3    NaN
4    2.0
5    0.0
dtype: float64

In [4]:
dates = pd.date_range('20200301', periods=6)
print(dates)

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# 使用dates作为索引，'ABCD'作为列名，创建一个DataFrame
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print(df)

                   A         B         C         D
2020-03-01  0.430862  1.935463 -1.323624 -0.479013
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-05  0.578426  1.351542  1.653390 -0.576946
2020-03-06 -0.623175  0.399984 -0.261960  0.417470

In [12]:
# 用对象的字典创建DataFrame
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'
})
print(df2)
print([3] * 4)
print([3,2] * 4)
print(df2.dtypes)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo
[3, 3, 3, 3]
[3, 2, 3, 2, 3, 2, 3, 2]
A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head()

                   A         B         C         D
2020-03-01  0.430862  1.935463 -1.323624 -0.479013
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-05  0.578426  1.351542  1.653390 -0.576946

In [14]:
df.tail()

                   A         B         C         D
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-05  0.578426  1.351542  1.653390 -0.576946
2020-03-06 -0.623175  0.399984 -0.261960  0.417470

In [17]:
df.index

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
'''DataFrame.to_numpy()将DataFrame的底层数据转换为Numpy数组，输出不包含DataFrame索引和列标签。
如果DataFrame的列数据类型不同，这个操作开销会很大。
Numpy数组只有一种dtype，而pandas的DataFrame每列一种dtype。
调用DataFrame.to_numpy()时，pandas会找出兼容DataFrame中所有dtype的对应的Numpy dtype。
最终dtype可能是object，这就需要将每个值强转为一个Python object。
'''
df.to_numpy()

array([[ 0.43086214,  1.93546263, -1.32362394, -0.47901345],
       [-1.04537419,  0.03735822, -0.93758278, -0.96536845],
       [ 0.91352009,  0.4079186 , -0.44497336, -1.03710519],
       [ 1.4294262 ,  0.18293566,  0.09123099, -1.13683472],
       [ 0.57842591,  1.35154247,  1.65338986, -0.57694592],
       [-0.62317545,  0.39998413, -0.26196014,  0.41747019]])

In [20]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.280614  0.719200 -0.203920 -0.629633
std    0.938796  0.752387  1.038286  0.575829
min   -1.045374  0.037358 -1.323624 -1.136835
25%   -0.359666  0.237198 -0.814430 -1.019171
50%    0.504644  0.403951 -0.353467 -0.771157
75%    0.829747  1.115637  0.002933 -0.503497
max    1.429426  1.935463  1.653390  0.417470

In [22]:
# 数据转置(索引变为列名，列名变为索引)
df.T

   2020-03-01  2020-03-02  2020-03-03  2020-03-04  2020-03-05  2020-03-06
A    0.430862   -1.045374    0.913520    1.429426    0.578426   -0.623175
B    1.935463    0.037358    0.407919    0.182936    1.351542    0.399984
C   -1.323624   -0.937583   -0.444973    0.091231    1.653390   -0.261960
D   -0.479013   -0.965368   -1.037105   -1.136835   -0.576946    0.417470

In [25]:
# 按指定的轴排序
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2020-03-01 -0.479013 -1.323624  1.935463  0.430862
2020-03-02 -0.965368 -0.937583  0.037358 -1.045374
2020-03-03 -1.037105 -0.444973  0.407919  0.913520
2020-03-04 -1.136835  0.091231  0.182936  1.429426
2020-03-05 -0.576946  1.653390  1.351542  0.578426
2020-03-06  0.417470 -0.261960  0.399984 -0.623175

In [26]:
# 按指定列的值排序
df.sort_values(by='B')

                   A         B         C         D
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-06 -0.623175  0.399984 -0.261960  0.417470
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-05  0.578426  1.351542  1.653390 -0.576946
2020-03-01  0.430862  1.935463 -1.323624 -0.479013

In [27]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2020-03-01  0.430862  1.935463 -1.323624 -0.479013
2020-03-05  0.578426  1.351542  1.653390 -0.576946
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-06 -0.623175  0.399984 -0.261960  0.417470
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368

In [28]:
#-------------选择
# 选择一列，等价于 df.A
df['A']

2020-03-01    0.430862
2020-03-02   -1.045374
2020-03-03    0.913520
2020-03-04    1.429426
2020-03-05    0.578426
2020-03-06   -0.623175
Freq: D, Name: A, dtype: float64

In [29]:
# 按行筛选
df[0:3]

                   A         B         C         D
2020-03-01  0.430862  1.935463 -1.323624 -0.479013
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105

In [30]:
# 按索引筛选
df['20200302':'20200304']

                   A         B         C         D
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-04  1.429426  0.182936  0.091231 -1.136835

In [31]:
# -----用标签筛选（用的是字符串） loc
df.loc[dates[1]]

A   -1.045374
B    0.037358
C   -0.937583
D   -0.965368
Name: 2020-03-02 00:00:00, dtype: float64

In [32]:
# 多轴筛选
df.loc[:, ['A','B']]

                   A         B
2020-03-01  0.430862  1.935463
2020-03-02 -1.045374  0.037358
2020-03-03  0.913520  0.407919
2020-03-04  1.429426  0.182936
2020-03-05  0.578426  1.351542
2020-03-06 -0.623175  0.399984

In [33]:
# 标签切取
df.loc['20200302':'20200305', ['A','B']]

                   A         B
2020-03-02 -1.045374  0.037358
2020-03-03  0.913520  0.407919
2020-03-04  1.429426  0.182936
2020-03-05  0.578426  1.351542

In [34]:
# 减少输出数据的维度
df.loc['20200303', ['A','B']]

A    0.913520
B    0.407919
Name: 2020-03-03 00:00:00, dtype: float64

In [35]:
# 精确的获取一个值
df.loc[dates[0], 'A']

0.43086213745110624

In [36]:
# 与df.loc[dates[0], 'A']结果等价，但是更快
df.at[dates[0],'A']

0.43086213745110624

In [37]:
# -------用位置筛选(用的是整数) iloc
df.iloc[3]

A    1.429426
B    0.182936
C    0.091231
D   -1.136835
Name: 2020-03-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:5,0:2]

                   A         B
2020-03-04  1.429426  0.182936
2020-03-05  0.578426  1.351542

In [39]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2020-03-02 -1.045374 -0.937583
2020-03-03  0.913520 -0.444973
2020-03-05  0.578426  1.653390

In [40]:
# 明确的按行切取
df.iloc[1:3,:]

                   A         B         C         D
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368
2020-03-03  0.913520  0.407919 -0.444973 -1.037105

In [41]:
# 明确的按列切取
df.iloc[:,1:3]

                   B         C
2020-03-01  1.935463 -1.323624
2020-03-02  0.037358 -0.937583
2020-03-03  0.407919 -0.444973
2020-03-04  0.182936  0.091231
2020-03-05  1.351542  1.653390
2020-03-06  0.399984 -0.261960

In [42]:
# 获取一个值
df.iloc[1,1]

0.03735821616702052

In [43]:
# 获取一个值（更快速）
df.iat[1,1]

0.03735821616702052

In [44]:
#-----布尔索引
# 根据某一列的值产生的布尔索引来选择数据
df[df['A'] > 0]

                   A         B         C         D
2020-03-01  0.430862  1.935463 -1.323624 -0.479013
2020-03-03  0.913520  0.407919 -0.444973 -1.037105
2020-03-04  1.429426  0.182936  0.091231 -1.136835
2020-03-05  0.578426  1.351542  1.653390 -0.576946

In [45]:
# 从整个DataFrame筛选符合条件的值
df[df > 0]

                   A         B         C        D
2020-03-01  0.430862  1.935463       NaN      NaN
2020-03-02       NaN  0.037358       NaN      NaN
2020-03-03  0.913520  0.407919       NaN      NaN
2020-03-04  1.429426  0.182936  0.091231      NaN
2020-03-05  0.578426  1.351542  1.653390      NaN
2020-03-06       NaN  0.399984       NaN  0.41747

In [47]:
# 使用isin()方法来过滤
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2020-03-01  0.430862  1.935463 -1.323624 -0.479013    one
2020-03-02 -1.045374  0.037358 -0.937583 -0.965368    one
2020-03-03  0.913520  0.407919 -0.444973 -1.037105    two
2020-03-04  1.429426  0.182936  0.091231 -1.136835  three
2020-03-05  0.578426  1.351542  1.653390 -0.576946   four
2020-03-06 -0.623175  0.399984 -0.261960  0.417470  three

In [48]:
df2[df2['E'].isin(['two','three'])]

                   A         B         C         D      E
2020-03-03  0.913520  0.407919 -0.444973 -1.037105    two
2020-03-04  1.429426  0.182936  0.091231 -1.136835  three
2020-03-06 -0.623175  0.399984 -0.261960  0.417470  three

In [57]:
# ----------------设置
# 创建一个新的Series，新Series会自动按照索引将数据对齐

s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20200302',periods=6))
s1

2020-03-02    1
2020-03-03    2
2020-03-04    3
2020-03-05    4
2020-03-06    5
2020-03-07    6
Freq: D, dtype: int64

In [58]:
df['F'] = s1
df

                   A         B         C  D    F
2020-03-01  0.000000  0.000000 -1.323624  5  NaN
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0
2020-03-03  0.913520  0.407919 -0.444973  5  2.0
2020-03-04  1.429426  0.182936  0.091231  5  3.0
2020-03-05  0.578426  1.351542  1.653390  5  4.0
2020-03-06 -0.623175  0.399984 -0.261960  5  5.0

In [59]:
# 使用标签设置值
df.at[dates[0], 'A'] = 0

In [60]:
# 使用位置设置值
df.iat[0,1] = 0

In [61]:
# 用Numpy数组给DataFrame赋值
df.loc[:,'D'] = np.array([5]*len(df))
df

                   A         B         C  D    F
2020-03-01  0.000000  0.000000 -1.323624  5  NaN
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0
2020-03-03  0.913520  0.407919 -0.444973  5  2.0
2020-03-04  1.429426  0.182936  0.091231  5  3.0
2020-03-05  0.578426  1.351542  1.653390  5  4.0
2020-03-06 -0.623175  0.399984 -0.261960  5  5.0

In [62]:
df2 = df.copy()
# 相当于sql语句中的where
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2020-03-01  0.000000  0.000000 -1.323624 -5  NaN
2020-03-02 -1.045374 -0.037358 -0.937583 -5 -1.0
2020-03-03 -0.913520 -0.407919 -0.444973 -5 -2.0
2020-03-04 -1.429426 -0.182936 -0.091231 -5 -3.0
2020-03-05 -0.578426 -1.351542 -1.653390 -5 -4.0
2020-03-06 -0.623175 -0.399984 -0.261960 -5 -5.0

In [63]:
# -----缺失的数据
'''pandas主要使用np.nan来代表丢失的数据。默认情况下，它不参与运算。
reindex操作可以改变、增加或者删除指定轴的索引，并返回数据的拷贝。
'''
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2020-03-01  0.000000  0.000000 -1.323624  5  NaN NaN
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0 NaN
2020-03-03  0.913520  0.407919 -0.444973  5  2.0 NaN
2020-03-04  1.429426  0.182936  0.091231  5  3.0 NaN

In [64]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2020-03-01  0.000000  0.000000 -1.323624  5  NaN  1.0
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0  1.0
2020-03-03  0.913520  0.407919 -0.444973  5  2.0  NaN
2020-03-04  1.429426  0.182936  0.091231  5  3.0  NaN

In [65]:
# 删除含有丢失数据的任意行
df1.dropna(how='any')

                   A         B         C  D    F    E
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0  1.0

In [66]:
# 使用指定值填充丢失的数据
df1.fillna(value=5)

                   A         B         C  D    F    E
2020-03-01  0.000000  0.000000 -1.323624  5  5.0  1.0
2020-03-02 -1.045374  0.037358 -0.937583  5  1.0  1.0
2020-03-03  0.913520  0.407919 -0.444973  5  2.0  5.0
2020-03-04  1.429426  0.182936  0.091231  5  3.0  5.0

In [67]:
# 获取nan位置的boolean mask
pd.isna(df1)

                A      B      C      D      F      E
2020-03-01  False  False  False  False   True  False
2020-03-02  False  False  False  False  False  False
2020-03-03  False  False  False  False  False   True
2020-03-04  False  False  False  False  False   True

In [68]:
# --------统计 Stats
# 这些操作不包含na
# 平均值
df.mean()

A    0.208804
B    0.396623
C   -0.203920
D    5.000000
F    3.000000
dtype: float64

In [70]:
# 另一个轴方向上的平均值
df.mean(1)

2020-03-01    0.919094
2020-03-02    0.810880
2020-03-03    1.575293
2020-03-04    1.940719
2020-03-05    2.516672
2020-03-06    1.902970
Freq: D, dtype: float64

In [71]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2020-03-01    NaN
2020-03-02    NaN
2020-03-03    1.0
2020-03-04    3.0
2020-03-05    5.0
2020-03-06    NaN
Freq: D, dtype: float64

In [72]:
# 与nan进行运算，结果都是nan
df.sub(s, axis='index')

                   A         B         C    D    F
2020-03-01       NaN       NaN       NaN  NaN  NaN
2020-03-02       NaN       NaN       NaN  NaN  NaN
2020-03-03 -0.086480 -0.592081 -1.444973  4.0  1.0
2020-03-04 -1.570574 -2.817064 -2.908769  2.0  0.0
2020-03-05 -4.421574 -3.648458 -3.346610  0.0 -1.0
2020-03-06       NaN       NaN       NaN  NaN  NaN

In [69]:
# 统计描述
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean   0.208804  0.396623 -0.203920  5.0  3.000000
std    0.941479  0.498809  1.038286  0.0  1.581139
min   -1.045374  0.000000 -1.323624  5.0  1.000000
25%   -0.467382  0.073753 -0.814430  5.0  2.000000
50%    0.289213  0.291460 -0.353467  5.0  3.000000
75%    0.829747  0.405935  0.002933  5.0  4.000000
max    1.429426  1.351542  1.653390  5.0  5.000000

In [73]:
# -----对数据应用函数
# 求每列的前N项和
df.apply(np.cumsum)

                   A         B         C   D     F
2020-03-01  0.000000  0.000000 -1.323624   5   NaN
2020-03-02 -1.045374  0.037358 -2.261207  10   1.0
2020-03-03 -0.131854  0.445277 -2.706180  15   3.0
2020-03-04  1.297572  0.628212 -2.614949  20   6.0
2020-03-05  1.875998  1.979755 -0.961559  25  10.0
2020-03-06  1.252823  2.379739 -1.223519  30  15.0

In [74]:
# 每列的最大值减最小值
df.apply(lambda x: x.max() - x.min())

A    2.474800
B    1.351542
C    2.977014
D    0.000000
F    4.000000
dtype: float64

In [75]:
# ---------Histogramming
# value_counts方法，Series有这个方法，pandas也有这个顶级方法
# 用来计算一个一维数组的值的histogram。可以用于一般的数组
data = np.random.randint(0,7, 50)
data

array([0, 5, 2, 4, 6, 2, 2, 6, 4, 2, 5, 2, 6, 1, 0, 4, 0, 5, 0, 3, 0, 0,
       1, 4, 0, 6, 0, 0, 2, 5, 6, 4, 3, 0, 0, 5, 1, 0, 4, 5, 3, 5, 0, 0,
       6, 3, 1, 6, 3, 5])

In [76]:
s = pd.Series(data)
s

0     0
1     5
2     2
3     4
4     6
5     2
6     2
7     6
8     4
9     2
10    5
11    2
12    6
13    1
14    0
15    4
16    0
17    5
18    0
19    3
20    0
21    0
22    1
23    4
24    0
25    6
26    0
27    0
28    2
29    5
30    6
31    4
32    3
33    0
34    0
35    5
36    1
37    0
38    4
39    5
40    3
41    5
42    0
43    0
44    6
45    3
46    1
47    6
48    3
49    5
dtype: int32

In [77]:
s.value_counts()

0    14
5     8
6     7
4     6
2     6
3     5
1     4
dtype: int64

In [78]:
pd.value_counts(data)

0    14
5     8
6     7
4     6
2     6
3     5
1     4
dtype: int64

In [79]:
# mode方法，可以用来获取Series或者DataFrame中出现最频繁的值
s5 = pd.Series([1,1,3,3,3,5,6,5,7,7,7])
s5.mode()

0    3
1    7
dtype: int64

In [80]:
df5 = pd.DataFrame({"A": np.random.randint(0, 5, size=20),
                    "B": np.random.randint(-5, 7, size=20)})
df5

    A  B
0   0  5
1   0  1
2   3 -1
3   1  1
4   0  5
5   3 -1
6   2 -1
7   0 -3
8   0 -4
9   1 -5
10  3  1
11  2  4
12  2 -4
13  0 -2
14  1  5
15  3 -2
16  0  3
17  4  6
18  4 -3
19  0  0

In [81]:
# 每列出现最频繁的值
df5.mode()

     A  B
0  0.0 -1
1  NaN  1
2  NaN  5

In [83]:
# --------离散化和量化（Discretization and quantiling）
''' 离散化，把无限空间中的有限个体映射到有限的空间中去，以提高算法的效率。
通俗地将，离散化是在不改变数据相对大小的条件下，对数据进行相应的缩小，
但是，离散化仅适用于只关注元素之间的大小关系而不关注元素本身值大小的情况。'''
''' 连续的值可以使用cut()方法（bins based on values，基于值的区间）
和qcut()方法（bins based on sample quantiles，基于样本量化的区间）进行离散化'''
arr = np.random.randn(20)
arr

array([-1.34380386, -0.11372689,  0.31538539, -1.84424921,  1.22758216,
       -0.2960277 ,  0.86269281, -0.37184281,  0.69769806, -1.11029939,
       -0.37316464,  1.06289277,  0.54650444, -0.67777007, -0.41741348,
       -1.40389206,  1.78493303, -0.68061814,  1.30802652, -0.09837282])

In [84]:
factor = pd.cut(arr, 4)
factor

[(-1.848, -0.937], (-0.937, -0.0297], (-0.0297, 0.878], (-1.848, -0.937], (0.878, 1.785], ..., (-1.848, -0.937], (0.878, 1.785], (-0.937, -0.0297], (0.878, 1.785], (-0.937, -0.0297]]
Length: 20
Categories (4, interval[float64]): [(-1.848, -0.937] < (-0.937, -0.0297] < (-0.0297, 0.878] < (0.878, 1.785]]

In [85]:
factor = pd.cut(arr, [-5,-1,0,1,5])
factor

[(-5, -1], (-1, 0], (0, 1], (-5, -1], (1, 5], ..., (-5, -1], (1, 5], (-1, 0], (1, 5], (-1, 0]]
Length: 20
Categories (4, interval[int64]): [(-5, -1] < (-1, 0] < (0, 1] < (1, 5]]

In [86]:
# qcut()方法计算出样本量化。
# 比如，把正态分布数据切分成等值量化的（equal-size quartiles)
arr = np.random.randn(30)
arr

array([-0.82688296, -0.6560777 ,  1.19020799, -0.35183352, -0.14963503,
       -1.7271593 , -1.01998028,  0.12105835, -1.00176054, -0.68871008,
        0.08756632,  0.7130028 ,  1.0476772 , -1.42097316,  1.2759589 ,
       -1.17590376, -0.00492659, -0.58380549,  1.48643151, -0.27442619,
        2.08256023, -0.15118526, -4.12834772,  0.85139508, -0.56209641,
        0.73949437, -1.24221556,  0.4602695 , -0.93466374, -0.96851034])

In [87]:
factor = pd.qcut(arr, [0,.25,.5,.75,1])
factor

[(-0.96, -0.313], (-0.96, -0.313], (0.65, 2.083], (-0.96, -0.313], (-0.313, 0.65], ..., (0.65, 2.083], (-4.1290000000000004, -0.96], (-0.313, 0.65], (-0.96, -0.313], (-4.1290000000000004, -0.96]]
Length: 30
Categories (4, interval[float64]): [(-4.1290000000000004, -0.96] < (-0.96, -0.313] < (-0.313, 0.65] < (0.65, 2.083]]

In [88]:
pd.value_counts(factor)

(0.65, 2.083]                   8
(-4.1290000000000004, -0.96]    8
(-0.313, 0.65]                  7
(-0.96, -0.313]                 7
dtype: int64

In [89]:
# 可以传递无限值来定义区间
arr = np.random.randn(20)
arr

array([-0.55270138, -0.31592227,  0.39452374,  2.6046218 ,  2.1345023 ,
       -0.77378444, -0.21700001,  1.9007265 , -0.01925383,  0.39723957,
       -1.092763  , -0.31133915, -0.55094572, -2.26140651, -0.03863147,
       -0.12641678,  0.62736346, -0.72604124, -1.26766591,  0.68659744])

In [90]:
factor = pd.cut(arr, [-np.inf, 0, np.inf])
factor

[(-inf, 0.0], (-inf, 0.0], (0.0, inf], (0.0, inf], (0.0, inf], ..., (-inf, 0.0], (0.0, inf], (-inf, 0.0], (-inf, 0.0], (0.0, inf]]
Length: 20
Categories (2, interval[float64]): [(-inf, 0.0] < (0.0, inf]]

In [4]:
# -----------String 方法
'''Series的str属性中有很多的字符串处理方法，在操作数组的每个元素时很方便。
str中的pattern-matching通常使用正则表达式'''
s = pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'],dtype="string")
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [5]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [6]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5    <NA>
6    CABA
7     DOG
8     CAT
dtype: string

In [7]:
s.str.len()

0       1
1       1
2       1
3       4
4       4
5    <NA>
6       4
7       3
8       3
dtype: Int64

In [10]:
idx = pd.Index([' jack','jill',' jesse ','frank'])
idx.str.strip()

Index(['jack', 'jill', 'jesse', 'frank'], dtype='object')

In [11]:
idx.str.lstrip()

Index(['jack', 'jill', 'jesse ', 'frank'], dtype='object')

In [12]:
idx.str.rstrip()

Index([' jack', 'jill', ' jesse', 'frank'], dtype='object')

In [13]:
# string方法在清理或转换DataFrame列的时候非常有用，
# 比如，对于列名的开头或者结尾有空格的时候
df = pd.DataFrame(np.random.randn(3,2),
                 columns=[' Column A ',' Column B '],index=range(3))
df

    Column A    Column B
0   -0.037932    0.405048
1   -1.245958   -0.772735
2    0.396257   -0.612309

In [14]:
# df.columns是一个索引对象
df.columns

Index([' Column A ', ' Column B '], dtype='object')

In [17]:
# 可以用df.columns的str属性：df.columns.str
df.columns.str.strip()

Index(['Column A', 'Column B'], dtype='object')

In [18]:
df.columns.str.lower()

Index([' column a ', ' column b '], dtype='object')

In [19]:
'''可以用string方法按照需要清理列名。
比如，去掉首尾空格、转为小写、用下划线替换中间的空格
'''
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df

   column_a  column_b
0 -0.037932  0.405048
1 -1.245958 -0.772735
2  0.396257 -0.612309

In [ ]:
'''
如果一个Series中大量的元素是重复的（即，Series中唯一元素的数量比Series的长度小很多），
这时，把源Series转换为category类型，然后使用.str.<method>或者.dt.<property>会快很多。
性能提高的原因是，对于category类型的Series，字符串操作是基于.categories进行的而不是基于Series的每个元素进行的。

但是，要注意的是，category类型的Series的.categories与string类型的Series相比有一些限制，
比如，对于category类型的Series s，s + " " + s是不会起作用的。
'''

In [2]:
# ---------切分和替换字符串
s2 = pd.Series(['a_b_c','c_d_e',np.nan,'f_g_h'],dtype="string")
s2

0    a_b_c
1    c_d_e
2     <NA>
3    f_g_h
dtype: string

In [3]:
s2.str.split('_')

0    [a, b, c]
1    [c, d, e]
2         <NA>
3    [f, g, h]
dtype: object

In [4]:
s2.str.split('_').str.get(1)

0       b
1       d
2    <NA>
3       g
dtype: object

In [6]:
s2.str.split('_').str[1]

0       b
1       d
2    <NA>
3       g
dtype: object

In [7]:
# 使用expand可以很简单的让split方法返回一个DataFrame
# 如果源Series是StringDtype的，输出列也都是StringDtype的。
s2.str.split('_', expand=True)

      0     1     2
0     a     b     c
1     c     d     e
2  <NA>  <NA>  <NA>
3     f     g     h

In [9]:
# 可以限制切分次数
s2.str.split('_', expand=True, n=1)

      0     1
0     a   b_c
1     c   d_e
2  <NA>  <NA>
3     f   g_h

In [10]:
# rsplit 方法，从相反的方向（从右边开始）切分
s2.str.rsplit('_', expand=True, n=1)

      0     1
0   a_b     c
1   c_d     e
2  <NA>  <NA>
3   f_g     h

In [11]:
# replace 方法默认替换正则表达式
s3 = pd.Series(['A','B','C','Aaba','Baca',''
               ,np.nan,'CABA','dog','cat'], dtype="string")
s3

0       A
1       B
2       C
3    Aaba
4    Baca
5
6    <NA>
7    CABA
8     dog
9     cat
dtype: string

In [12]:
s3.str.replace('^.a|dog','XX-XX ',case=False)

0           A
1           B
2           C
3    XX-XX ba
4    XX-XX ca
5
6        <NA>
7    XX-XX BA
8      XX-XX
9     XX-XX t
dtype: string

In [14]:
# 如果要直接替换字符而不是正则表达式，要将可选参数regex设置为False
dollars = pd.Series(['12', '-$10', '$10,000'], dtype="string")
dollars

0         12
1       -$10
2    $10,000
dtype: string

In [15]:
# 下面两个语句结果是一样的
dollars.str.replace(r'-\$', '-')

0         12
1        -10
2    $10,000
dtype: string

In [16]:
dollars.str.replace('-$', '-', regex=False)

0         12
1        -10
2    $10,000
dtype: string

In [17]:
# -----------连结 Concatenation
# 把Series连结为一个字符串
s = pd.Series(['a','b','c','d'],dtype="string")
s

0    a
1    b
2    c
3    d
dtype: string

In [18]:
s.str.cat(sep=',')

'a,b,c,d'

In [19]:
# 未指定分隔符的情况下，分隔符为''空串
s.str.cat()

'abcd'

In [20]:
# 连结时，默认忽略nan，可以指定字符串来替换nan
t = pd.Series(['a', 'b', np.nan, 'd'], dtype="string")
t.str.cat(sep=',')

'a,b,d'

In [21]:
t.str.cat(sep=',', na_rep='-')

'a,b,-,d'

In [22]:
# 也可以把一个Series或者类似集合的数据连结进Series中
s.str.cat(['A','B','C','D'])

0    aA
1    bB
2    cC
3    dD
dtype: string

In [23]:
# 不管是源Series还是参Series，na对应的结果都是na，除非使用了na替换字符
s.str.cat(t)

0      aa
1      bb
2    <NA>
3      dd
dtype: string

In [24]:
s.str.cat(t,na_rep='-')

0    aa
1    bb
2    c-
3    dd
dtype: string

In [26]:
# Series的连结
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -2.563073  1.808508  1.061852  1.085904
1  1.220586  0.176943  0.509447  1.580486
2 -1.100364 -0.371716 -2.221470  0.293397
3  0.026891 -0.513514  0.195726 -0.816611
4 -0.629976  0.265054  1.114336  0.749925
5  0.554556 -0.158437  1.410687 -1.294275
6  1.133125  0.850596 -1.091943 -0.974547
7  0.724111 -0.049009  1.829869 -0.292022
8 -0.351738  1.303349  0.455762 -1.343434
9  0.344138  0.340735  0.373891 -1.401907

In [27]:
pieces = [df[:3],df[3:7],df[7:]]
pieces

[          0         1         2         3
 0 -2.563073  1.808508  1.061852  1.085904
 1  1.220586  0.176943  0.509447  1.580486
 2 -1.100364 -0.371716 -2.221470  0.293397,
           0         1         2         3
 3  0.026891 -0.513514  0.195726 -0.816611
 4 -0.629976  0.265054  1.114336  0.749925
 5  0.554556 -0.158437  1.410687 -1.294275
 6  1.133125  0.850596 -1.091943 -0.974547,
           0         1         2         3
 7  0.724111 -0.049009  1.829869 -0.292022
 8 -0.351738  1.303349  0.455762 -1.343434
 9  0.344138  0.340735  0.373891 -1.401907]

In [28]:
'''
往DataFrame增加一列是相对较快的，但是，增加一行需要复制，可能开销比较大。
推荐把构建好的记录集合传入DataFrame构造器，而不推荐创建DataFrame后往里面逐条添加数据。
'''
pd.concat(pieces)

          0         1         2         3
0 -2.563073  1.808508  1.061852  1.085904
1  1.220586  0.176943  0.509447  1.580486
2 -1.100364 -0.371716 -2.221470  0.293397
3  0.026891 -0.513514  0.195726 -0.816611
4 -0.629976  0.265054  1.114336  0.749925
5  0.554556 -0.158437  1.410687 -1.294275
6  1.133125  0.850596 -1.091943 -0.974547
7  0.724111 -0.049009  1.829869 -0.292022
8 -0.351738  1.303349  0.455762 -1.343434
9  0.344138  0.340735  0.373891 -1.401907

In [29]:
# ---------Join 连接
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [30]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [31]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [32]:
# 另一个join的例子
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [33]:
# ---------Group By
'''通过Group by，可以：
    把数据划分为多个组
    为每个组执行不同的函数
    把结果合并到一个新的数据结构
'''
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.451813  1.042825
1  bar    one  1.686615  0.051873
2  foo    two  0.665606  0.783919
3  bar  three  0.304121 -1.863978
4  foo    two -0.132050 -0.042405
5  bar    two -1.529081 -1.111686
6  foo    one  0.988825  0.850836
7  foo  three -0.279695  0.319724

In [34]:
# 按A列分组，并执行sum
df.groupby('A').sum()

            C         D
A
bar  0.461655 -2.923791
foo  0.790873  2.954899

In [35]:
# 按A列、B列分组，并执行sum
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.686615  0.051873
    three  0.304121 -1.863978
    two   -1.529081 -1.111686
foo one    0.537012  1.893661
    three -0.279695  0.319724
    two    0.533556  0.741514

In [36]:
# -----Stack
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
# 多重索引
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])
df

                     A         B
first second
bar   one     0.739641 -0.079339
      two     0.353682  0.449742
baz   one    -1.524192  0.642469
      two    -0.381081 -1.807578
foo   one     0.237660 -0.274972
      two     1.004421  0.572083
qux   one     1.783287  1.769792
      two     0.166598 -0.585123

In [38]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.739641 -0.079339
      two     0.353682  0.449742
baz   one    -1.524192  0.642469
      two    -0.381081 -1.807578

In [39]:
# stack()方法，将DataFrame的列压缩到同一层
stacked = df2.stack()
stacked

first  second
bar    one     A    0.739641
               B   -0.079339
       two     A    0.353682
               B    0.449742
baz    one     A   -1.524192
               B    0.642469
       two     A   -0.381081
               B   -1.807578
dtype: float64

In [68]:
# stack的逆操作是unstack，默认的unstack层级是最后一层
stacked.unstack()

                     A         B
first second
bar   one     0.739641 -0.079339
      two     0.353682  0.449742
baz   one    -1.524192  0.642469
      two    -0.381081 -1.807578

In [41]:
stacked.unstack(1)

second        one       two
first
bar   A  0.739641  0.353682
      B -0.079339  0.449742
baz   A -1.524192 -0.381081
      B  0.642469 -1.807578

In [42]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.739641 -1.524192
       B -0.079339  0.642469
two    A  0.353682 -0.381081
       B  0.449742 -1.807578

In [43]:
# -----Pivot
'''
pivot_table()方法
用来创建一个透视表，参数：
    data:DataFrame对象
    values:要聚合的列或者列的集合
    index：Group by的列
    columns：Group by的列,感觉好像是columns列unstack
    aggfunc：聚合函数，默认为numpy.mean
'''
df = pd.DataFrame({
    'A': ['one', 'one', 'two', 'three'] * 3,
    'B': ['A', 'B', 'C'] * 4,
    'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
    'D': np.random.randn(12),
    'E': np.random.randn(12)
})
df

        A  B    C         D         E
0     one  A  foo -0.166381 -0.655913
1     one  B  foo  0.491533  1.185715
2     two  C  foo  0.437779 -0.670537
3   three  A  bar  0.841977 -0.442500
4     one  B  bar -1.884633 -0.259751
5     one  C  bar -0.523826  0.006000
6     two  A  foo  0.260744  0.574275
7   three  B  foo  0.804698 -1.107394
8     one  C  foo -1.301662  0.054102
9     one  A  bar -0.314469 -1.964056
10    two  B  bar -0.248276 -0.395749
11  three  C  bar  0.687159  0.195796

In [48]:
pd.pivot_table(df, values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A -0.314469 -0.166381
      B -1.884633  0.491533
      C -0.523826 -1.301662
three A  0.841977       NaN
      B       NaN  0.804698
      C  0.687159       NaN
two   A       NaN  0.260744
      B -0.248276       NaN
      C       NaN  0.437779

In [66]:
dfao = df.loc[df['A'] == 'one']
dfaob = dfao.loc[dfao['B']=='A']
dfaob

     A  B    C         D         E
0  one  A  foo -0.166381 -0.655913
9  one  A  bar -0.314469 -1.964056

In [71]:
dfnoe = dfaob.drop(['E'],axis=1)
dfnoe

     A  B    C         D
0  one  A  foo -0.166381
9  one  A  bar -0.314469

In [78]:
rd = pd.read_csv('file.csv')
rd

   id  姓名  age
0   1  张三   21
1   2  李四   22
2   3  王五   23
3   4  赵六   24

In [79]:
pd.isnull(rd['id'])

0    False
1    False
2    False
3    False
Name: id, dtype: bool

In [80]:
len(rd)

4

In [85]:
rd.loc[:,'age']

0    21
1    22
2    23
3    24
Name: age, dtype: int64